package day0219;

public class Ex03 {
}
/*
	* 메서드
		- 클래스변수의 값을 변경하는 역할
		  객체를 생성한 후 다양한 기능을 수행하는 역할
		- 객체간의 데이터를 전달하는 수단으로 사용됨.
		- 외부로부터의 매개값을 받을 수 있고, 실행 후 결과를 리턴할 수 있다.
		- 메서드는 호출(사용)한 곳으로 돌아온다.
		
	* 메서드 선언
		선언부 구현부 이루어져 있음
			()까지 선언부		{}구현부
		리턴타입 메서드이름(매개변수, ...){
			코드 구현부분
		}
		- 리턴타입 : 메서드가 리턴하는 결과값의 타입
		- 메서드이름 : 어떤 기능을 하는지 유추 가능한 이름 사용
		- () : 메서드가 실행할 때 필요한 데이터를 받기위한 변수
		- {} : 메서드의 실행 영역
		
	* 리턴타입
		- 메서드가 실행한 후 결과값의 데이터(자료형)타입
		- 실행한 후에 호출한 곳으로 넘겨줄 값이 있는 경우
		있는 경우 / 없는 경우
		 예)	powerOn() 메서드 : 전원만 켜면 끝
		 	나누는 기능 divide() 메서드 : 나눗셈의 결과값을 리턴.
		
*/